opts = {
    "alias": ("кеша тучка", "кеша", "кешун", "кеше", "кешечка", "кишан", "инокентий", "иннокентий",
              "кешунчик", "кеш", "кишун", "геша", "кишон", "киш", "кишаня", "кяш", "кяша", "кэщ", "кэша", "кеши"),
    "tbr": ("скажи", "произнеси", "сколько", "расскажи", "покажи", "пожалуйста", "пж"),
    "cmd": {
        "hello": ("привет", "здаров", "здарова", "hello", "здравствуйте", "привет привет", ""),  # !
        "search_browser": ("что", "как", "когда", "почему", "какой", "какие", "каков", "какие",  # !
                           "кто такой", "что такое", "почему такое", ""),  # !
        "how_are_you": ("дела", "делишки", "поживаешь", "чувствуешь себя", "как дела", ""),  # !
        # "weather": ("погода", "градусов", "какая погода", ""),
        "volume": ("громкость", ""),  # !
        "open": ("открой", "открыть", "открой ютуб", "открой youtube", "от края", "открой блокнот", ""),
        "thanks": ("спасибо", ""),  # !
        "fire": ("пожар", "тревога", ""),  # !
        "creator": ("тебя создал", "твой создатель", "твой изобретатель", ""),  # !
        "yourself": ("расскажи о себе", "скажи о себе", ""),  # !
        "turn": ("сверни", "разверни", "верни", "верни все окна", "сверни все окна", "разверни все окна", ""),  # !
        "time": ("текущее время", "который час", "сейчас времени", "какое время сейчас",  # !
                 "сколько сейчас времени", ""),  # !
        "what_are_you_doing": ("что делаешь", ""),  # !
        "ctrl+c": ("скопируй", "копировать", "скопировать", "контрл ц", ""),  # !
        "ctrl+v": ("вставь", "вставить", "ставить", "контрл в", ""),  # !
        "ctrl+x": ("вырежи", "вырезать", "контрл x", "контрл икс", ""),  # !
        "change_lang": ("смени язык", "измени язык", "сменить язык", ""),  # !
        "delete": ("удали", "удалить", ""),  # !
        "alt+f4": ("закрой блокнот", "закрой", ""),  # !
        "ctrl+a": ("выдели всё", "выбери всё", ""),  # !
        # "help": ("помощь", "какие у тебя есть команды", "команды", ""),
        "write": ("напиши", "напечатай", "напиши привет", "напечатай привет", ""),  # !
        "enter": ("enter", "ентер", "нажми enter", "нажми ентер", ""),  # !
        "esc": ("нажми esc", "нажми ескейп", "нажми эскейп", "еск", "ескейп", "esc", "escape", ""),  # !
        "youtube": ("открой на ютубе", "открой на youtube", "открой в ютубе", "открой в youtube",
                    "найди на ютубе", "найди на youtube", ""),
        "restart_windows": ("перезагрузи компьютер", "перезапусти компьютер", "перезагрузи ноутбук",  # !
                            "перезапусти ноутбук", "перезагрузи", "перезапусти", ""),  # !
        "off_windows": ("заверши и работу", "выключи компьютер", "заверши работу компьютера", "выключи ноутбук",  # !
                        "заверши работу ноутбука", ""),  # !
        "get_day": ("какой сегодня день", "сегодняшний дней", "какой день сегодня", "какой день", ""),  # !
        "joke": ("расскажи анекдот", "анекдот", "расскажи шутку", "шутку", ""),  # !
        "verse": ("расскажи стих", "стих", ""),  # !
        "what_is_your_name": ("как тебя зовут", "как твоё имя", ""),  # !
        "off_screen": ("выключи монитор", "отключи монитор", "выключи экран", "отключи экран", ""),  # !
        "kill_process": ("выключи программу", "отключи программу", "заверши работу программы",  # !
                         "закрой дискорд", ""),  # !
        # -- умный дом --
        "light_on": ("включи свет", ""),
        "light_off": ("выключи свет", ""),
        "water_on": ("включи воду", "включи ванну", ""),
        "water_off": ("выключи воду", "выключи ванну" ""),
        "window_open": ("открой окно", "открыть окно", "окно открой", ""),
        "window_close": ("закрой окно", "закрыть окно", "окно закрой", ""),
        "get_temperature": ("какая температура", "скажи температуру", ""),
    },
    "answer": {
        "hello": ("Здравствуйте сэр", "Здравствуйте", "Привет"),  # !
        "search_browser": {  # !
            "complete": ("Найдено", "Давайте поищем в интернете"),
            "deny": "Возможно у вас проблемы с интернетом",
        },
        "how_are_you": ("Отлично", "Нормально", "Хорошо"),
        "open": {
            "accept": ("Открываю", "Давайте поищем в интернете"),
            "deny": {
                "EXE": "Я не смог найти такое приложение",
                "WebSite": "Я не смог найти такую страницу в интернете",
                "All": "Я не смог найти"
            },
        },
        "kill_process": {
            "deny": "Я не смог найти такое приложение"
        },
        "thanks": ("Пожалуйста", "Всегда готов помочь"),
        "creator": "Меня создали Егор и Гриша",
        "yourself": "Я голосовой помощник Кеша, меня создал Егор и Гриша, я нужен чтобы помогать людям",
        "turn": "Выполнено",
        "time": ("Время сейчас: ", "Время: ", "Сейчас: "),
        "what_are_you_doing": ("Работаю для вас", "Помогаю вам"),
        "unclear": "Я вас не понял",
        "volume": {  # !
            "accept": "Выполнено",
            "error_valid_number": "Вы сказали громкость которую не возможно поставить",
            "error_level": "Я могу установить громкость только на определённый уровень"
        },
        "complete": "Выполнено!",
        "youtube": ("Открываю", "Выполнено"),
        "restart_windows": ("Перезагружаю", "Выполняю"),
        "off_windows": ("Выключаю", "Выполняю"),
        "off_screen": ("Выключаю", "Выполняю"),
        "func_windows": "У вас отключены функции Windows",
        "help": ("Я вывел вам их на экран", "Вот они", "Я предоставил их вам"),
        "what_is_your_name": "Меня зовут Кеша"
    },
    "filtration_word": {
        "weather": ("погода", "какая", "температура", "градусов", "сколько", "в", "на", "улице"),
        "open": {
            "EXE": ("приложение", "программу", "игру", "спасибо", "открой"),
            "WebSite": ("сайт", "страницу", "спасибо", "открой")
        },
        "kill_process": ("заверши", "завершить", "завершил", "приложение",
                         "программу", "игру", "спасибо", "закрой", "выключи"),
        "write": ("напиши", "напечатай"),
        "youtube": ("видео", "ютуб", "ютубе", "на", "в", "видос", "видосик", "видик", "youtube", "найди",
                    "открой", "ютуби")
    },
    "error_words": {
        "volume": ("меньше", "больше", "выше", "громче", "тише", "ниже")
    }
}
